УправДом/src/InformationRegisters/НормативыКоммунальныхУслуг/НормативыКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативыКоммунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Норматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/InformationRegisters/НормативыКоммунальныхУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Возвращает актуальный Норматив для указанного вида платежа на указанную дату.
//
// Параметры:
//  ВидПлатежа - СправочникСсылка.ВидыПлатежей - Вид платежа, для которого нужно найти Норматив.
//  ДатаАктуальности - Дата - Дата, на которую ищется актуальный Норматив. По умолчанию - текущая.
//
// Возвращаемое значение:
//  Число - Значение Норматива. Если Норматив не найден, возвращает 0.
//
Функция ПолучитьАктуальныйНорматив(ВидПлатежа, ДатаАктуальности = Неопределено) Экспорт
	
	// Если дата не передана, используем текущую дату сеанса
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Проверка входных данных
	Если ВидПлатежа.Пустая() Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НормативыКоммунальныхУслугСрезПоследних.Норматив КАК Норматив
		|ИЗ
		|	РегистрСведений.НормативыКоммунальныхУслуг.СрезПоследних(&ДатаАктуальности,) КАК
		|		НормативыКоммунальныхУслугСрезПоследних
		|ГДЕ
		|	НормативыКоммунальныхУслугСрезПоследних.ВидПлатежа = &ВидПлатежа";
	
	Запрос.УстановитьПараметр("ВидПлатежа", ВидПлатежа);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].Норматив;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#КонецЕсли
